app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "編集しました\r\n"], ["updated_at", "2019-04-08 10:45:58.715372"], ["id", 1]]
---
  def update
  	post = Post.find(params[:id])
  	post.update(post_params)

INSERT INTO "posts" ("created_at", "updated_at", "title", "body", "image_id") VALUES (?, ?, ?, ?, ?)
---
  def create
  	post = Post.new(post_params)
  	post.save